[
  "Patient Demographics: Maria Garcia, Date of Birth: March 12, 1976 (Age: 49), Female, MRN: MRN-457891, Primary Provider: Dr. Evelyn Moore, Referring Providers: Dr. Samuel Park (Endocrinologist), Dr. Priya Patel (Gynecologist), Integrated Women's Hormone & Thyroid Center, 123 Wellness Blvd, Suite 200, New Haven, CT, Phone: (203) 555-1942",
  
  "Active Medical Conditions: Hypothyroidism (Hashimoto's thyroiditis) (Diagnosed: 2017) - TSH: 4.8 mIU/L (elevated), Free T4: Low-normal, Thyroid peroxidase antibodies: Positive, Currently on levothyroxine 100 mcg daily. Menopausal Syndrome (Current) - FSH: Elevated (>40 mIU/mL), Estradiol: Low, Last menstrual period: ~12 months ago, Symptoms include hot flashes, decreased libido, sleep disturbance. Subclinical or under-treated hypothyroidism - Worsening fatigue, weight gain, difficulty concentrating despite stable thyroid dosing.",
  
  "Past Medical History: Hypothyroidism (Hashimoto's thyroiditis) - diagnosed 8 years ago, Perimenopausal/Menopausal transition, No history of cardiovascular disease or cancer",
  
  "Current Medications: Levothyroxine 100 mcg - Once daily (being adjusted to 112 mcg), Melatonin - Occasional OTC for sleep, Newly Prescribed: Transdermal estradiol patch 0.05 mg/day, Oral micronized progesterone 100 mg - Nightly",
  
  "Allergies: No known drug allergies",
  
  "Social History: Occupation: Not specified, Smoking: Non-smoker, Alcohol: Occasional alcohol use, Exercise: Active lifestyle with moderate exercise, Menstrual Status: Last menstrual period approximately 12 months ago",
  
  "Family History: Mother: Hypothyroidism, No known family history of breast or ovarian cancer, Other family history: Not specified in current report",
  
  "Recent Vital Signs (Current Visit - June 1, 2025): Height: 162 cm (5'4\"), Weight: 78 kg (172 lbs), BMI: 29.7, Blood Pressure: 122/78 mmHg, Heart Rate: 72 bpm, Temperature: Not recorded, Physical Exam: No goiter or nodules palpable, Dry mildly cool skin, Mild slowed neurological response",
  
  "Current Visit Scenario: Scheduled Appointment Type: Follow-up for hypothyroidism and menopausal symptoms. Patient's Stated Reason for Visit: Persistent menopausal symptoms and worsening hypothyroid symptoms despite ongoing levothyroxine treatment. Symptoms include hot flashes, decreased libido, sleep disturbance, cognitive fog, fatigue, weight gain, and difficulty concentrating over the past 6-9 months.",
  
  "Recent Laboratory Results - Thyroid Function (Current): TSH: 4.8 mIU/L (elevated, Normal: 0.4-4.0), Free T4: Low-normal, Thyroid peroxidase antibodies: Positive (confirming Hashimoto's thyroiditis)",
  
  "Recent Laboratory Results - Hormonal Panel (Current): FSH: Elevated (>40 mIU/mL), Estradiol: Low (consistent with menopause)",
  
  "Recent Laboratory Results - Other (Current): Lipid Panel: Mild hyperlipidemia, Complete Blood Count (CBC): Within normal limits, Liver Function Tests (LFTs): Within normal limits, Glucose: Within normal limits",
  
  "Assessment & Diagnosis: 1. Menopausal syndrome, 2. Subclinical or under-treated hypothyroidism (likely influenced by estrogen fluctuations), 3. Interaction risk between thyroid-binding globulin elevation from HRT and levothyroxine efficacy",
  
  "Plan of Care: Gynecology (HRT Initiation): Initiate transdermal estradiol patch (0.05 mg/day) and oral micronized progesterone 100 mg nightly, Baseline mammogram and pelvic ultrasound requested, Patient education on risks/benefits of HRT. Endocrinology (Thyroid Management): Adjust levothyroxine to 112 mcg daily, Repeat TSH and Free T4 in 6-8 weeks after HRT initiation, Monitor for overlapping or worsening symptoms, Counsel on HRT's effect on TBG and levothyroxine metabolism",
  
  "Follow-up Schedule: Endocrinologist: 6 weeks post-HRT initiation, Gynecologist: 8 weeks for HRT symptom review and safety monitoring, Patient advised to report new symptoms (palpitations, breast tenderness, bleeding), Shared electronic health record for interdisciplinary communication",
  
  "Provider Notes: Maria's case illustrates the need for integrated care between gynecology and endocrinology. Her symptoms are multifactorial and require collaborative medication management and lab monitoring. The treatment approach is aimed at optimizing both hormonal and thyroid health concurrently. Prepared by: Dr. Evelyn Moore, MD, Integrated Women's Hormone & Thyroid Center, Date: June 1, 2025"
] 